# 2.1[10]: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть. Количество монет и их положение (0 или 1) 
# пользователь вводит с клавиатуры.
# Примеры/Тесты:
# Введите кол-во монет>? 5
# Положение монеты 0: 0 или 1>? 1
# ...
# 1 0 1 1 0
# Кол-во монет, чтобы перевернуть: 2

n = int(input('Введите колличество монет: '))
eagle = 0
tail = 0

for i in range(n):
    eagle_or_tails = int(input('Введите положение монеты ' + str(i + 1) + ': '))
    if eagle_or_tails == 1:
        eagle += eagle_or_tails

    if eagle_or_tails == 0:
        tail += eagle_or_tails +1
    if eagle < tail:
        print(f'Кол-во монет, чтобы перевернуть: {eagle}')
    else:
        print(f'Кол-во монет, чтобы перевернуть: {tail}')
  