# 3.2[18]: Требуется найти в списке целых чисел самый близкий по величине элемент к заданному числу X.
# Пользователь вводит это число с клавиатуры, список можно считать заданным. Введенное число не обязательно содержится в списке.

# Примеры/Тесты:

# Input: [10, 5, 7, 3, 3, 2, 5, 7, 3, 8], X = 0
# Output: 2
# Input: [10, 5, 7, 3, 3, 2, 5, 7, 3, 8], X = 9
# Output: 10



list = [10, 5, 7, 3, 3, 2, 5, 7, 3, 8]
x = 2

array = abs(x - list[0])
element = list[0]

for idx, el in enumerate(list):
    if abs(el - x) < array:
        array = abs(el - x)
        element = list[idx]

print(element)